In [2]:
import numpy as np
import pandas as pd

In [16]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [17]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [18]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [19]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [13]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],'City':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [21]:
dict3={'Names':['Ramesh','Suresh',null,'Mahesh'],
      'Age':[31,32,33,Null],'City':[Null,'Hyd','Mumbai','Chennai']}
data3=pd.DataFrame(dict3)
data3

NameError: name 'null' is not defined

**Method1**

In [24]:
Filling the missing values with random number

dataframe name=data1

Method name: fillna

SyntaxError: invalid syntax (3206947882.py, line 1)

In [23]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

In [25]:
data1['Names'].fillna('sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  sathish  33.0   Mumbai
3   Mahesh   NaN  Chennai

In [26]:
#create the data again
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

# Method3
- bfill
- ffill
- pad
- backfill

In [31]:
data1.fillna(method='backfill')
#names index2 is missed value
#it will relace by index3 value
#Age index 3 is missed value
#we dont have index 4, so the value is Nan only
#city index 0 is a missed value 
#it is replaced with index1 value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [32]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [33]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [34]:
data1.fillna(method='bfill')

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [35]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

- bfill and back fill both are same
- pad and ffill both are same

***Method4***

- Mean
- median
- Mode

In [37]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [38]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [39]:
#instead providing a random number, we r filling with mean of the data

In [40]:
age_median=data1['Age'].median()
age_median

32.0

In [41]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [42]:
#instead providing a random number, we r filling with median of the data

In [43]:
#instead providing a random number, we r filling with mode of the data
age_mode=data1['Age'].mode()
age_mode
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

# Method 5: KNN imputer

KNN: K nearest neighbours
    
- in the KNN instead of taking mean of all the values
- will choose neighbours data 
- will take those mean only
- only for numerical data not categorical data

In [46]:
KNN Imputer

SyntaxError: invalid syntax (1444565758.py, line 1)

In [ ]:
n_neighbors is parameter can choose

In [50]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [51]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

****Method 6****

- Based on other columns 
- Sometimes all above methods will not provide good justification
- at that time we need to check other columns dependency also
- MOst of the time will pick a colum which have highest correlation

In [54]:
Data Transformations

SyntaxError: invalid syntax (4059188923.py, line 1)